{"name": "BRIAN LARA", "cricketing_nation": "West Indies", "birth_date": " May 02, 1969", "birth_place": " Cantaro", "bats": " Left", "bowls": "Right", "role": "", "bowling_style": " Legbreak", "stats": {"test": {"teams_played_for": "West Indies, ICC World XI", "batting": {"2002": {"innings": "10", "runs": "351", "balls": "695", "outs": "10", "avg": "35.1", "sr": "50.5", "hs": "73", "50s": "3", "100s": "0", "4s": "42", "6s": "1", "dot_percent": "76.3"}, "2003": {"innings": "19", "runs": "1,344", "balls": "2,128", "outs": "18", "avg": "74.7", "sr": "63.2", "hs": "209", "50s": "5", "100s": "5", "4s": "178", "6s": "16", "dot_percent": "71.2"}, "2004": {"innings": "21", "runs": "1,176", "balls": "1,919", "outs": "20", "avg": "58.8", "sr": "61.3", "hs": "400", "50s": "4", "100s": "3", "4s": "147", "6s": "10", "dot_percent": "69.7"}, "2005": {"innings": "17", "runs": "1,110", "balls": "1,673", "outs": "17", "avg": "65.3", "sr": "66.3", "hs": "226", "50s": "0", "100s": "5", "4s": "133", "6s": "9", "dot_percent": "67.7"}, "2006": {"innings": "18", "runs": "749", "balls": "1,247", "outs": "18", "avg": "41.6", "sr": "60.1", "hs": "216", "50s": "2", "100s": "3", "4s": "92", "6s": "10", "dot_percent": "72.8"}, "overall": {"innings": "85", "runs": "4,730", "balls": "7,662", "outs": "83", "avg": "57.0", "sr": "61.7", "hs": "400", "50s": "14", "100s": "16", "4s": "592", "6s": "46", "dot_percent": "70.8"}}, "bowling": {"overall": {}}}, "odi": {"teams_played_for": "West Indies, ICC World XI", "batting": {"2002": {"innings": "9", "runs": "292", "balls": "398", "outs": "6", "avg": "48.7", "sr": "73.4", "hs": "111", "50s": "1", "100s": "1", "4s": "23", "6s": "3", "dot_percent": "59.0"}, "2003": {"innings": "21", "runs": "888", "balls": "1,056", "outs": "19", "avg": "46.7", "sr": "84.1", "hs": "116", "50s": "4", "100s": "3", "4s": "82", "6s": "20", "dot_percent": "56.1"}, "2004": {"innings": "18", "runs": "484", "balls": "589", "outs": "15", "avg": "32.3", "sr": "82.2", "hs": "59", "50s": "3", "100s": "0", "4s": "52", "6s": "5", "dot_percent": "56.4"}, "2005": {"innings": "15", "runs": "438", "balls": "529", "outs": "15", "avg": "29.2", "sr": "82.8", "hs": "156", "50s": "2", "100s": "1", "4s": "39", "6s": "7", "dot_percent": "55.4"}, "2006": {"innings": "26", "runs": "660", "balls": "864", "outs": "21", "avg": "31.4", "sr": "76.4", "hs": "87", "50s": "4", "100s": "0", "4s": "69", "6s": "14", "dot_percent": "60.5"}, "2007": {"innings": "11", "runs": "386", "balls": "443", "outs": "10", "avg": "38.6", "sr": "87.1", "hs": "83", "50s": "2", "100s": "0", "4s": "31", "6s": "9", "dot_percent": "51.2"}, "overall": {"innings": "100", "runs": "3,148", "balls": "3,879", "outs": "86", "avg": "36.6", "sr": "81.2", "hs": "156", "50s": "16", "100s": "5", "4s": "296", "6s": "58", "dot_percent": "56.8"}}, "bowling": {"2003": {"innings": "1", "overs": "1.0", "runs": "15", "wickets": "0", "eco": "15.00", "avg": "-", "sr": "-", "5w": "0", "bbi": "0/15"}, "overall": {"innings": "1", "overs": "1.0", "runs": "15", "wickets": "0", "eco": "15.00", "avg": "-", "sr": "-", "5w": "0", "bbi": "0/15"}}}}, "profile": "A hero, a magician, an entertainer, a match-winner, a saviour, a leader, a tragic romantic, Brian Charles Lara, like a masterful actor, slipped in and out of several roles with effortless ease. First thing's first, Lara will forever be remembered as one of the greatest batsmen of the modern era, bracketed alongside the elite company of Sachin Tendulkar, Ricky Ponting and Jacques Kallis.\n\nLara's wizardry and sheer style though would trump any batsman including the aforementioned troika. Another attribute that set him up as a cut above the rest was his voracious appetite for big, massive scores. Armed with a high backlift, generating that typical Caribbean flourish, Lara was equally efficient against spin and pace. Ask Shane Warne, Muttiah Muralitharan, Wasim Akram, Glenn McGrath and the rest of their breed.\n\nLara initially excelled in junior soccer and table tennis but cricket was his burning love. As a 15 year old lad at Fatima college in Port of Spain, Lara amassed as many as 7 three figure scores in a single season of the inter-school competition. Under-19 and first-class cricket followed suit. In only his second first-class encounter, the southpaw held fort for more than 300 minutes, compiling 92 against Trinidad and Tobago's sporting rivals - Barbados - in a sterling effort that defied the likes of Joel Garner and Malcom Marshall.\n\nThere was no looking back as Lara, at the age of 20, was appointed as T&T's captain, thus claiming the honour of becoming the youngest ever to lead Trinidad and Tobago. In the absence of Viv Richards, Lara was handed his Test debut the same year against Pakistan in Lahore, making 44 and 6. Right after the Test though he was banished to the domestic circuit and returned to the biggest stage only after the departure of Viv.\n\nSoon, Lara established himself as the West Indies' main man. While the rest of the team was in doldrums during the 1992 World Cup, Lara, who opened the batting, rattled 333 at a breezy rate.\n\nTwo years later he produced a monumental feat, notching up 375 versus England at Antigua, which was incidentally bettered by himself at the same venue about a decade later, earning the distinction as the first and only player to register 400 in Tests, an immortal landmark, which stands undimmed by the passage of time. His unconquered 153 in a nerve-wracking 1 wicket triumph over the Aussies in 1999 was also the stuff of legends.\n\nHaving cracked 501* for Warwickshire, just weeks after authoring 375, Lara eclipsed Hanif Mohammad's 499 to own the highest first-class score in cricket history. Never since Sir Donald Bradman had a batsman racked up runs for fun. Lara was special, he was an all-time colossus in the making.\n\nThe Trinidad ace eventually topped the Test runs charts before the honour was snatched away by Sachin Tendulkar. Lara too tallied 10000+ runs in the ODI format with the pick of his knocks being the 129-ball-169 against a spin loaded Sri Lankan attack, helping West Indies squeeze out a narrow 4 run victory in Sharjah. Among a plethora of records, Lara has etched a century against every Test playing nation.\n\nHe was enlisted with three stints of captaincy but did not shine as much as his batting did in each of those opportunities (or curses). It was not Lara's fault, for he was devoid of appropriate resources.\n\nUnder his leadership, West Indies suffered the ignominy of their first whitewash at the hands of South Africa before losing to England in the Caribbean. With the failures of his compatriots stretching the list further Lara assumed the role of an one man army. It was a pity that Lara's illustrious career coincided with West Indies hurtling into an abyss. He copped a fair share of criticism during his multiple tenures as skipper but he survived the turbulent period, which would have capsized a less seaworthy vessel.\n\nEver the fighter, Lara inspired his troops to the ICC champions trophy title victory in 2004 in Old Blighty, which remains the highlight of his captaincy. Lara hung up his wonderfully worn international boots following the 2007 World Cup, where hosts West Indies progressed to the Super Eights round. During the time of Lara's departure, speculations were rife that his run-ins with the authority had swelled to a crescendo but his outstanding contribution to the sport cannot be undermined.\n\nPost retirement, Lara plunged into T20s, signing up for the now-disbanded Indian Cricket League and served as the skipper of Mumbai Champs. Later, his services were hired by Southern Rocks, a Zimbabwe franchise for the 2010-11 Stanbic Bank 20 competition. Fittingly, the Prince of Trinidad, was inducted into the ICC Hall of Fame in 2012.\n\nBy Deivarayan Muthu"}