{"name": "LOKESH RAHUL", "cricketing_nation": "India", "birth_date": " April 18, 1992", "birth_place": " Bangalore", "bats": " Right", "bowls": "", "role": "", "bowling_style": "", "stats": {"test": {"teams_played_for": "India", "batting": {"2014": {"innings": "2", "runs": "4", "balls": "13", "outs": "2", "avg": "2.0", "sr": "30.8", "hs": "3", "50s": "0", "100s": "0", "4s": "0", "6s": "0", "dot_percent": "76.9"}, "2015": {"innings": "8", "runs": "252", "balls": "526", "outs": "8", "avg": "31.5", "sr": "47.9", "hs": "110", "50s": "0", "100s": "2", "4s": "29", "6s": "2", "dot_percent": "77.6"}, "2016": {"innings": "9", "runs": "539", "balls": "869", "outs": "9", "avg": "59.9", "sr": "62.0", "hs": "199", "50s": "1", "100s": "2", "4s": "58", "6s": "7", "dot_percent": "69.3"}, "2017": {"innings": "14", "runs": "633", "balls": "1,075", "outs": "13", "avg": "48.7", "sr": "58.9", "hs": "90", "50s": "9", "100s": "0", "4s": "76", "6s": "2", "dot_percent": "67.8"}, "2018": {"innings": "22", "runs": "468", "balls": "793", "outs": "21", "avg": "22.3", "sr": "59.0", "hs": "149", "50s": "1", "100s": "1", "4s": "60", "6s": "3", "dot_percent": "70.4"}, "2019": {"innings": "5", "runs": "106", "balls": "277", "outs": "5", "avg": "21.2", "sr": "38.3", "hs": "44", "50s": "0", "100s": "0", "4s": "14", "6s": "0", "dot_percent": "80.9"}, "overall": {"innings": "60", "runs": "2,002", "balls": "3,553", "outs": "58", "avg": "34.5", "sr": "56.3", "hs": "199", "50s": "11", "100s": "5", "4s": "237", "6s": "14", "dot_percent": "71.2"}}, "bowling": {"overall": {}}}, "odi": {"teams_played_for": "India", "batting": {"2016": {"innings": "3", "runs": "196", "balls": "235", "outs": "1", "avg": "196.0", "sr": "83.4", "hs": "100", "50s": "1", "100s": "1", "4s": "15", "6s": "3", "dot_percent": "50.6"}, "2017": {"innings": "6", "runs": "52", "balls": "72", "outs": "6", "avg": "8.7", "sr": "72.2", "hs": "17", "50s": "0", "100s": "0", "4s": "5", "6s": "1", "dot_percent": "61.1"}, "2018": {"innings": "3", "runs": "69", "balls": "86", "outs": "2", "avg": "34.5", "sr": "80.2", "hs": "60", "50s": "1", "100s": "0", "4s": "5", "6s": "1", "dot_percent": "50.0"}, "2019": {"innings": "13", "runs": "572", "balls": "705", "outs": "12", "avg": "47.7", "sr": "81.1", "hs": "111", "50s": "3", "100s": "2", "4s": "49", "6s": "9", "dot_percent": "51.6"}, "2020": {"innings": "6", "runs": "350", "balls": "325", "outs": "5", "avg": "70.0", "sr": "107.7", "hs": "112", "50s": "2", "100s": "1", "4s": "24", "6s": "11", "dot_percent": "37.2"}, "overall": {"innings": "31", "runs": "1,239", "balls": "1,423", "outs": "26", "avg": "47.7", "sr": "87.1", "hs": "112", "50s": "7", "100s": "4", "4s": "98", "6s": "25", "dot_percent": "48.6"}}, "bowling": {"overall": {}}}, "t20i": {"teams_played_for": "India", "batting": {"2016": {"innings": "4", "runs": "179", "balls": "112", "outs": "2", "avg": "89.5", "sr": "159.8", "hs": "110", "50s": "0", "100s": "1", "4s": "17", "6s": "8", "dot_percent": "33.9"}, "2017": {"innings": "7", "runs": "279", "balls": "198", "outs": "7", "avg": "39.9", "sr": "140.9", "hs": "89", "50s": "3", "100s": "0", "4s": "24", "6s": "12", "dot_percent": "32.8"}, "2018": {"innings": "11", "runs": "324", "balls": "217", "outs": "9", "avg": "36.0", "sr": "149.3", "hs": "101", "50s": "1", "100s": "1", "4s": "26", "6s": "16", "dot_percent": "31.3"}, "2019": {"innings": "9", "runs": "356", "balls": "250", "outs": "8", "avg": "44.5", "sr": "142.4", "hs": "91", "50s": "4", "100s": "0", "4s": "35", "6s": "14", "dot_percent": "32.4"}, "2020": {"innings": "7", "runs": "323", "balls": "223", "outs": "6", "avg": "53.8", "sr": "144.8", "hs": "57", "50s": "3", "100s": "0", "4s": "27", "6s": "11", "dot_percent": "26.0"}, "overall": {"innings": "38", "runs": "1,461", "balls": "1,000", "outs": "32", "avg": "45.7", "sr": "146.1", "hs": "110", "50s": "11", "100s": "2", "4s": "129", "6s": "61", "dot_percent": "31.0"}}, "bowling": {"overall": {}}}, "twenty20": {"teams_played_for": "Royal Challengers Bangalore, Sunrisers Hyderabad, Kings XI Punjab", "batting": {"2013": {"innings": "2", "runs": "20", "balls": "16", "outs": "2", "avg": "10.0", "sr": "125.0", "hs": "12", "50s": "0", "100s": "0", "4s": "4", "6s": "0", "dot_percent": "56.2"}, "2014": {"innings": "8", "runs": "166", "balls": "164", "outs": "8", "avg": "20.8", "sr": "101.2", "hs": "46", "50s": "0", "100s": "0", "4s": "12", "6s": "3", "dot_percent": "36.6"}, "2015": {"innings": "8", "runs": "142", "balls": "126", "outs": "5", "avg": "28.4", "sr": "112.7", "hs": "44", "50s": "0", "100s": "0", "4s": "8", "6s": "5", "dot_percent": "37.3"}, "2016": {"innings": "12", "runs": "397", "balls": "271", "outs": "9", "avg": "44.1", "sr": "146.5", "hs": "68", "50s": "4", "100s": "0", "4s": "37", "6s": "16", "dot_percent": "31.7"}, "2018": {"innings": "14", "runs": "659", "balls": "416", "outs": "12", "avg": "54.9", "sr": "158.4", "hs": "95", "50s": "6", "100s": "0", "4s": "66", "6s": "32", "dot_percent": "34.1"}, "2019": {"innings": "14", "runs": "593", "balls": "438", "outs": "11", "avg": "53.9", "sr": "135.4", "hs": "100", "50s": "6", "100s": "1", "4s": "49", "6s": "25", "dot_percent": "34.9"}, "2020": {"innings": "14", "runs": "670", "balls": "518", "outs": "12", "avg": "55.8", "sr": "129.3", "hs": "132", "50s": "5", "100s": "1", "4s": "58", "6s": "23", "dot_percent": "34.0"}, "overall": {"innings": "72", "runs": "2,647", "balls": "1,949", "outs": "59", "avg": "44.9", "sr": "135.8", "hs": "132", "50s": "21", "100s": "2", "4s": "234", "6s": "104", "dot_percent": "34.5"}}, "bowling": {"overall": {}}}}, "profile": "Hailing from a background of high academic standards, KL Rahul was born and brought up in the prestigious National Institute of Technology, Karnataka, where his father is a professor in the department of Civil Engineering. He finished his schooling in NITK and grew to develop keen interest in cricket. Having started off with batting on the grass-less field of the college, Rahul's parents spotted a spark in him and decided that he must receive formal training in order to realize his talents.\n\nRahul rose through the ranks of Under-19 cricket and broke into the Karnataka first-class side and had a decent debut season in 2010-11. He was left out of the squad for the succeeding season, but he returned for the 2012-13 season, in which he had a prolific run of form, becoming the highest run-getter of the season, propelling himself into contention for the highest honour of them all – an India Test cap.\n\nThe prospect of a debut on a momentous occasion like the Boxing Day at the MCG against the world's chirpiest team seemed to throw Rahul off his game, as he crumbled under pressure and lost his wicket to two shots unbecoming (to say the least) of a Test player. With the series already lost, and in a manifestation of compassion for Rahul's nervous jitters, the selectors and the captain decided to give Rahul a go at his usual opening spot in the Sydney Test. He had a dramatic redemption in Sydney as he stroked his way to a patient century, proving that he belongs in the national side – to himself, more than anyone else.\n\nThis hundred gave Rahul some momentum, and he went on to make hundreds in Sri Lanka and West Indies on away tours, making the opening combination a dilemma for the Indian selectors. He showed his tendency to convert starts, making his first three fifty-plus scores count, and going on to score a hundred each time. However, he continued to have anxious starts and got the reputation of an 'all-or-nothing' player.\n\nRahul was selected in the limited-overs squads to Zimbabwe and West Indies in mid-2016. It was then that Rahul showed his versatility across formats, bursting forth with a hundred each on ODI and T20I debut, after a fine run in the IPL for the Royal Challengers Bangalore. The young right-hander got a chance to play his first home Test, but a series of injuries and recurrences managed to keep him going in and out of the playing XI until the Chennai Test against England in late 2017 when he made a full recovery. He went on to make a heart-breaking 199 in Chennai; his current highest score in Test cricket.\n\nWith an ideal mentor in Rahul Dravid, KL Rahul shares more than his first name with the Indian legend; the dogged resistance, the compact, airtight technique, and the unimpeachable focus at the crease are all common factors between the two batting technicians. Rahul does need to work a tad more on his nerves, though, after his tame dismissal on 199 in Chennai further reinforced his image as a timorous player. However, with age on his side, Rahul can work on his nerves and with an all-conditions' technique to go with it, he is an exciting prospect for India's long and challenging overseas season and he would like to reinforce his spot as a long-term option for India as a premier Test opener.\n\nAfter a run-glut in the 2016/17 seasons, Rahul had a poor 2018 in Test cricket, as he got his first exposure to the moving ball on the surfaces of South Africa, Australia and England. He struggled through all the overseas tour in red-ball cricket, and almost lived a double-life as a white-ball player, bagging a massive 11-crore IPL contract, and ending up as Punjab's best batsman in the 2018 season of the tournament. However, in Test cricket, he was struggling to score so much that he failed to grab the easiest of chances even against a weakened Windies line-up at home. He was eventually dropped from the Test side, as his career fell just short of a full-circle, receiving the ouster for the Boxing Day Test in Melbourne in favour of his Karnataka mate Mayank Agarwal - the very same event in which his Test journey began in 2014.\n\nJust when it looked like things couldn't get worse for Rahul, an episode of a talk show aired in India, in which Rahul, along with Hardik Pandya, were called out on social media for their misogynistic comments, and were suspended by the Board of Control for Cricket in India for poor conduct and tarnishing the image of Indian cricket. The ban has been lifted since the incident. However, at a crunch time, due to lack of form and off-field issues, Rahul suddenly finds himself in the fringes, with almost no chance to win himself a ticket to England. However, a few months still remain for him to prove his mettle, as he tries to cope with trouble in paradise.\n\nIPL - Through the years\n\nOn the back of his performances in the Syed Mushtaq Ali tournament in 2013, KL Rahul was drafted into the Royal Challengers Bangalore set-up, a line-up which boasted the names of Virat Kohli, AB de Villiers and Chris Gayle. In the following year, he was roped in by Sunrisers Hyderabad for Rs. 1 crore, where he got more opportunities to bat in the top/middle order. He returned to RCB in 2016 and the Karnataka batter proved his mettle in that edition of the Indian Premier League. He piled 397 runs in 14 matches and ended up as the third highest run-getter for his club.\n\nStrangely, he wasn’t retained by RCB and Kings XI Punjab took advantage of that in the 2018 IPL auctions. Rahul was bought for Rs. 11 crore, which turned out to be the joint-third highest price for that year. Batting at the top of the order, Rahul proved his worth by amassing 659 runs (average: 54.91, strike-rate: 158.41). He struck six fifties in 14 matches, out of which three were 90+ scores. KL Rahul also holds the record for the fastest IPL fifty (off just 14 balls).\n\nWorld Cup through the years\nKL Rahul, the man who made his Test debut just ahead of the 2015 World Cup, has grown exponentially in limited-overs cricket over the last few years since the 2015 World Cup. Despite scoring a hundred in the T20I format (apparently whilst inebriated), and earning himself a nine-figure IPL paycheque, Rahul has struggled to establish himself in the ODI game, particularly due to a top-order that is already established and a consequent inability to grasp his role in the middle-order. He has had several failures at the number 4 spot, but he made a case for himself in the 2019 IPL to be considered as a mature accumulator in the middle-order along with his hitting abilities - not to mention being one of the highest run-scorers in the tournament. Rahul, who was also a part of the Koffee with Karan controversy, has had a tough path back to the World Cup squad, after a run of poor form in the longer format in 2018, and off-field issues. However, he has exhibited his reserves of mental strength over the last few months and would be relieved and eager as he boards the flight to England.\n\nWritten by Rishi Roy"}