{"profile": "A right-handed batsman and a medium pacer by trade, Marcus Stoinis, is an Australian all-rounder. Stoinis was a member of the Australian side that featured in the 2008 Under-19 World Cup in Malaysia, a team that included players like Steven Smith, Phil Hughes, James Pattinson, Josh Hazlewood and James Faulkner.\n\nAt 19 years of age, Stoinis made his debut for Western Australia in January 2009. However, he couldn't quite become a permanent fixture in the playing eleven and decided to move to Victoria for the 2012-13 season.\n\nOn the recommendation of former teammate Theo Doropoulos, he decided to play for the Northcote Cricket Club in the Victorian Premier Cricket competition. Soon, things started to change for Stoinis as he enjoyed phenomenal success at Northcote. He smashed four centuries in 2013/14, averaging a massive 100 for the season.\n\nWith the kind of form Stoinis was in, his selection in the Victorian state team was inevitable and he was soon named in Victoria's Sheffield Shield squad. He didn't disappoint the Victorian selectors one bit, scoring a magnificent 170 against Tasmania, an innings that cemented his place in the Victorian top-order.\n\nHe was the top run-getter for Victoria in the 2014/15 Sheffield Shield season. He amassed 785 runs at an average of 49.06 during the summer. He was also a part of the Australian A outfit that visited India in July 2015. Stoinis, who made 77 and took 2/18 in the first four-day game against India A, was rewarded with a place in the national squad for the ODIs and the lone T20I against England in August-September 2015.\n\nWith time, he matured as a batsman, while his bowling was always handy. He opened the batting for Melbourne Stars in the 2018-19 BBL and has been in fine form of late. He is an integral part of Australia's plans at the 2019 World Cup.\n\nIPL through the years\n\nOne of the premium quality which isn't available in abundance in the Indian premier league is the 'bonafide all-rounders'. Marcus Stoinis belongs to that rare breed of cricketers who can bat anywhere in the batting order, bowl useful overs, both at the start and the end of a T20 innings and is a gun fielder. It is these qualities that prompted the Royal Challengers into entering a trade with the Kings XI Punjab ahead of the 2019 edition of the Indian Premier League. A late bloomer by international standards, Stoinis is a powerfully built man - who has the ability to clear any ground with his brutal hitting process.\n\nSigned by Delhi Daredevils in 2015, he didn't feature in the franchise's plans and was later bought by Kings XI Punjab in the subsequent auctions. Although his international record was on the upward curve, it didn't really translate into significant performances for the Mohali-based outfit. Nevertheless, the promise of a big future meant that they used their right to match card to grab him off RCB's hands - despite the move costing them 6.2 crores - during the 2018 IPL auction. Another average season though meant that KXIP had reasons to off-load their prized asset - when RCB came calling once again in 2019, they were happy to trade him for home bred, Mandeep Singh.\n\nWorld Cup through the years\nWith the 2019 World Cup, Stoinis is set to play his first tournament at the biggest stage. Given his multiple skill set and big-hitting ability, he will be a vital commodity for Australia on the pitches of\nEngland that are expected to be flat and high-scoring. Although Stoinis has the tendency to take a bit of time early on, even when batting at the death, it seems like a confidence issue which should be sorted with more game time and consistency.\n\nBy Rishi Roy"}